Autodesk.Revit.DB.ElementComparerByParameterData.ParameterId
Id of the parameter of which value is used when comparing two elements for sorting
Since:
2015

Autodesk.Revit.DB.ElementComparerByParameterData.Order
The order in which objects are to be sorted.
Since:
2015

Autodesk.Revit.DB.ElementComparerByParameterData.#ctor(Autodesk.Revit.DB.ElementId)
Constructor to instantiate a data with the given parameter Id and default sorting order.
Remarks:
Use the Order property to change the direction of sorting order as desired.
parameterId:
Id of the parameter used for comparison
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.ElementComparerByParameterData
Data class that defines behavior of a comparer that uses a parameter
to compare elements when sorting them in order to assign numbers to them.
Since:
2015